ArtrixDuxk/Flipper-Zero-ESP32-CYD/sdkconfig.defaults.esp32_cyd
# Target-specific overrides for ESP32-2432S028 (CYD classic) + NM-RF-HAT
# Applied when building with:
#   idf.py -B build_cyd -DFLIPPER_BOARD=esp32_cyd_nm_rf_hat \
#          -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.esp32_cyd" build
#
# Classic ESP32 has ~128 KB IRAM and ~320 KB DRAM and NO PSRAM.
# Defaults below push WiFi/BT/FreeRTOS code into flash and shrink buffers
# so the Flipper port can link. Expect lower WiFi/BLE peak throughput.

CONFIG_IDF_TARGET="esp32"

# ---- Flash / partitions (4 MB CYD) ----
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_singleapp_4mb.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_singleapp_4mb.csv"

# ---- CPU / FreeRTOS ----
CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
CONFIG_FREERTOS_TASK_NOTIFICATION_ARRAY_ENTRIES=3
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=1
# Required by furi_thread_enumerate() → uxTaskGetSystemState()
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
# CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS is not set
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=2048
# Move FreeRTOS helpers out of scarce IRAM (~several KB)
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_FREERTOS_PLACE_SNAPSHOT_FUNS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y

# No PSRAM on stock CYD
# CONFIG_SPIRAM is not set

# ---- Size / compiler ----
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
# CONFIG_COMPILER_OPTIMIZATION_PERF is not set
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y

CONFIG_HEAP_TRACING_OFF=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL=2
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3072

CONFIG_FATFS_LFN_HEAP=y

# NFC crypto (MIFARE / FeliCa helpers)
CONFIG_MBEDTLS_DES_C=y

# ---- BLE only (no Classic BR/EDR controller) ----
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
# CONFIG_BT_CLASSIC_ENABLED is not set
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
# CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY is not set
# CONFIG_BTDM_CTRL_MODE_BTDM is not set
CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY=y
CONFIG_BT_ACL_CONNECTIONS=1
# CONFIG_BT_MULTI_CONNECTION_ENBALE is not set
# Smaller Bluedroid host stacks — classic ESP32 is RAM-starved; large GATT
# tables cause "GATTS_ReserveHandles: no free handle blocks" at boot.
CONFIG_BT_BTC_TASK_STACK_SIZE=3072
CONFIG_BT_BTU_TASK_STACK_SIZE=3584
CONFIG_BT_GATT_MAX_SR_PROFILES=3
CONFIG_BT_GATT_MAX_SR_ATTRIBUTES=40
CONFIG_BT_GATTC_MAX_CACHE_CHAR=20

# ---- WiFi: tiny footprint (classic ESP32 CYD — larger buffers OOM-reboot) ----
# CONFIG_ESP_WIFI_IRAM_OPT is not set
# CONFIG_ESP_WIFI_RX_IRAM_OPT is not set
# CONFIG_ESP_WIFI_SLP_IRAM_OPT is not set
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=3
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=2
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=8
# CONFIG_ESP_WIFI_AMPDU_TX_ENABLED is not set
# CONFIG_ESP_WIFI_AMPDU_RX_ENABLED is not set
# CONFIG_ESP_WIFI_NVS_ENABLED is not set
# CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE is not set

# ---- lwIP / HTTP (wlan evil portal lite) ----
CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=2560
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Classic ESP32 has no USB-OTG — no TinyUSB
